---
type: FormatOptions
namespace: Autodesk.Revit.DB
version: 2024
members: 31
tags: [revit-api, class]
---

# FormatOptions

`Autodesk.Revit.DB.FormatOptions` · Revit 2024 · 31 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | FormatOptions | — | `` |
| Constructor | FormatOptions | 2014 | `public FormatOptions ()` |
| Method | CanHaveSymbol | — | `` |
| Method | CanHaveSymbol | 2014 | `public bool CanHaveSymbol ()` |
| Method | CanSuppressLeadingZeros | — | `` |
| Method | CanSuppressLeadingZeros | 2014 | `public bool CanSuppressLeadingZeros ()` |
| Method | CanSuppressSpaces | — | `` |
| Method | CanSuppressSpaces | 2014 | `public bool CanSuppressSpaces ()` |
| Method | CanSuppressTrailingZeros | — | `` |
| Method | CanSuppressTrailingZeros | 2014 | `public bool CanSuppressTrailingZeros ()` |
| Method | CanUsePlusPrefix | — | `` |
| Method | CanUsePlusPrefix | 2014 | `public bool CanUsePlusPrefix ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetSymbolTypeId | 2014 | `public ForgeTypeId GetSymbolTypeId ()` |
| Method | GetUnitTypeId | 2014 | `public ForgeTypeId GetUnitTypeId ()` |
| Method | GetValidSymbols | — | `` |
| Method | GetValidSymbols | 2014 | `public IList < ForgeTypeId > GetValidSymbols ()` |
| Method | IsValidAccuracy | — | `` |
| Method | IsValidForSpec | 2014 | `public bool IsValidForSpec ( ForgeTypeId specTypeId )` |
| Method | IsValidSymbol | — | `` |
| Method | SetSymbolTypeId | 2014 | `public void SetSymbolTypeId ( ForgeTypeId symbolTypeId )` |
| Method | SetUnitTypeId | 2014 | `public FormatOptions SetUnitTypeId ( ForgeTypeId unitTypeId )` |
| Property | Accuracy | 2014 | `public double Accuracy { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | RoundingMethod | 2016 | `public RoundingMethod RoundingMethod { get ; set ; }` |
| Property | SuppressLeadingZeros | 2014 | `public bool SuppressLeadingZeros { get ; set ; }` |
| Property | SuppressSpaces | 2014 | `public bool SuppressSpaces { get ; set ; }` |
| Property | SuppressTrailingZeros | 2014 | `public bool SuppressTrailingZeros { get ; set ; }` |
| Property | UseDefault | 2014 | `public bool UseDefault { get ; set ; }` |
| Property | UseDigitGrouping | 2014 | `public bool UseDigitGrouping { get ; set ; }` |
| Property | UsePlusPrefix | 2014 | `public bool UsePlusPrefix { get ; set ; }` |